{
    "backend": "tensorflow",
    "config": [
        {
            "config": {
                "dtype": "float32",
                "name": "dense_1",
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "units": 32,
                "batch_input_shape": [
                    null,
                    1000,
                    1
                ],
                "activation": "relu",
                "bias_regularizer": null,
                "trainable": true,
                "kernel_initializer": {
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null,
                        "scale": 1.0
                    },
                    "class_name": "VarianceScaling"
                },
                "activity_regularizer": null,
                "use_bias": true,
                "kernel_constraint": null,
                "bias_constraint": null,
                "kernel_regularizer": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "trainable": true,
                "name": "flatten_1"
            },
            "class_name": "Flatten"
        },
        {
            "config": {
                "name": "dense_2",
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "units": 1,
                "bias_regularizer": null,
                "activation": "sigmoid",
                "kernel_regularizer": null,
                "trainable": true,
                "kernel_initializer": {
                    "config": {
                        "distribution": "uniform",
                        "mode": "fan_avg",
                        "seed": null,
                        "scale": 1.0
                    },
                    "class_name": "VarianceScaling"
                },
                "activity_regularizer": null,
                "use_bias": true,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "class_name": "Dense"
        }
    ],
    "class_name": "Sequential",
    "keras_version": "2.1.1"
}
