{"config": [{"class_name": "Conv1D", "config": {"bias_regularizer": null, "dtype": "float32", "name": "conv1d_2", "activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "strides": [1], "dilation_rate": [1], "kernel_size": [3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 1000, 1], "activation": "relu", "filters": 32, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [4], "name": "max_pooling1d_3", "padding": "valid", "trainable": true, "strides": [4]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.2}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "bias_regularizer": null, "name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "return_sequences": true, "unit_forget_bias": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "return_state": false, "units": 32, "dropout": 0.4, "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.4, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "kernel_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "bias_regularizer": null, "name": "lstm_4", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "return_sequences": true, "unit_forget_bias": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "return_state": false, "units": 32, "dropout": 0.2, "go_backwards": false, "activity_regularizer": null, "trainable": true, "recurrent_dropout": 0.2, "recurrent_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "kernel_regularizer": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [4], "name": "max_pooling1d_4", "padding": "valid", "trainable": true, "strides": [4]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "dtype": "float32", "name": "dense_4", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "batch_input_shape": [null, 60], "units": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "units": 16, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1"}
