_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_2 (Conv1D)            (None, 998, 32)           128       
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 249, 32)           0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 249, 32)           0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 249, 32)           8320      
_________________________________________________________________
lstm_4 (LSTM)                (None, 249, 32)           8320      
_________________________________________________________________
dropout_4 (Dropout)          (None, 249, 32)           0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 62, 32)            0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 1984)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                63520     
_________________________________________________________________
dense_5 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 17        
=================================================================
Total params: 80,833
Trainable params: 80,833
Non-trainable params: 0
_________________________________________________________________
