{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"batch_input_shape": [null, 100, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "strides": [1], "filters": 32, "activation": "relu", "name": "conv1d_1", "dtype": "float32", "kernel_size": [3], "kernel_regularizer": null, "padding": "valid", "use_bias": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_size": [4], "padding": "valid", "name": "max_pooling1d_1", "strides": [4]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "go_backwards": false, "name": "lstm_1", "stateful": false, "use_bias": true, "units": 32, "recurrent_dropout": 0.4, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "return_state": false, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.4, "activity_regularizer": null, "implementation": 1, "bias_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "LSTM", "config": {"return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "go_backwards": false, "name": "lstm_2", "stateful": false, "use_bias": true, "units": 32, "recurrent_dropout": 0.2, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "return_state": false, "activation": "tanh", "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.2, "activity_regularizer": null, "implementation": 1, "bias_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_size": [4], "padding": "valid", "name": "max_pooling1d_2", "strides": [4]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "batch_input_shape": [null, 60], "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "sigmoid", "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}], "keras_version": "2.1.1"}
