_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000, 32)          64        
_________________________________________________________________
flatten_1 (Flatten)          (None, 32000)             0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 32001     
=================================================================
Total params: 32,065
Trainable params: 32,065
Non-trainable params: 0
_________________________________________________________________
