{
    "keras_version": "2.1.1",
    "config": [
        {
            "config": {
                "bias_constraint": null,
                "dtype": "float32",
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "seed": null,
                        "distribution": "uniform",
                        "mode": "fan_avg"
                    },
                    "class_name": "VarianceScaling"
                },
                "name": "dense_12",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    1000
                ],
                "use_bias": true,
                "activity_regularizer": null,
                "bias_regularizer": null,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "units": 32,
                "kernel_regularizer": null,
                "activation": "relu",
                "kernel_constraint": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "bias_constraint": null,
                "kernel_initializer": {
                    "config": {
                        "scale": 1.0,
                        "seed": null,
                        "distribution": "uniform",
                        "mode": "fan_avg"
                    },
                    "class_name": "VarianceScaling"
                },
                "name": "dense_13",
                "bias_regularizer": null,
                "use_bias": true,
                "activity_regularizer": null,
                "trainable": true,
                "bias_initializer": {
                    "config": {},
                    "class_name": "Zeros"
                },
                "units": 3,
                "kernel_regularizer": null,
                "activation": "softmax",
                "kernel_constraint": null
            },
            "class_name": "Dense"
        }
    ],
    "class_name": "Sequential",
    "backend": "tensorflow"
}
