_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_12 (Dense)             (None, 32)                32032     
_________________________________________________________________
dense_13 (Dense)             (None, 3)                 99        
=================================================================
Total params: 32,131
Trainable params: 32,131
Non-trainable params: 0
_________________________________________________________________
